//
//  13_循环嵌套.c
//  Day06
//
//  Created by tarena on 15/7/6.
//  Copyright (c) 2015年 tarena. All rights reserved.
//

#include <stdio.h>

int main()
{
    /*----打印以下图形---
     
     **********
     **********
     **********
     **********
     
     -----------------*/
    //外层循环执行4次，打印4行*
    for (int i = 0; i < 4; i++)
    {
        //内层循环执行10次，打印一行*
        for (int j = 0; j < 10; j++)
        {
            printf("*");
        }
        printf("\n");
    }
    
    /*----------------------
     
     *
     **
     ***
     ****
     *****
     ----------------------*/
    for (int i = 1; i <= 5; i++)
    {
        for (int j = 0; j < i; j++)
        {
            printf("*");
        }
        printf("\n");
    }
    
    /*--------------------
     1x1=1
     1x2=2   2x2=4
     1x3=3   2x3=6    3x3=9
     1x4=4   2x4=8    3x4=12   4x4=16
     ......
     1x9=9   2x9=18   ......
     ---------------------------*/
    for (int i = 1; i <= 9; i++)
    {
        for (int j = 1; j <= i; j++)
        {
            printf("%dx%d=%d\t", j, i, i * j);
        }
        printf("\n");
    }
    
    /*----------
     
          *
         ***
        *****
       *******
     --------------*/
    
    for (int i = 0; i < 4; i++)
    {
        for (int j = 3; j > i; j--)//0,1,2,3
        {
            printf(" ");
        }
        for (int j = 0; j < i * 2 + 1; j++)//1,3,5,7
        {
            printf("*");
        }
        printf("\n");
    }
    return 0;
}